README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-01 Вт 00:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>🚀Euphoria💥</title>
<meta name="author" content="Berezhnev Vladimir (Tell396)" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">🚀Euphoria💥</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfaf6e55">Server <code>[3/7]</code>:</a>
<ul>
<li><a href="#orgd09a63a"><span class="todo DOING">DOING</span> Add other (VK, Google) auth strategy</a></li>
<li><a href="#org54cb7c1"><span class="todo TODO">TODO</span> Move <i>https://localhost:3001</i> on server files to `.env`</a></li>
<li><a href="#org7e1dc23"><span class="todo TODO">TODO</span> Add auth with SMS step</a></li>
<li><a href="#orgcd05cd2"><span class="todo TODO">TODO</span> Photo uploading bugfix (server)</a></li>
<li><a href="#orgf87ab92"><span class="done DONE">DONE</span> Bugfix on database</a></li>
<li><a href="#org964deec"><span class="done DONE">DONE</span> Rewrite all twitter part of code to github</a></li>
<li><a href="#org19ac4bb"><span class="done DONE">DONE</span> Rewrite all components from JS to TS</a></li>
</ul>
</li>
<li><a href="#org2076f65">Client <code>[0/3]</code>:</a>
<ul>
<li><a href="#orge3744d0"><span class="todo TODO">TODO</span> Add responsive for mobile and tablet</a></li>
<li><a href="#orgdaafb8b"><span class="todo TODO">TODO</span> Photo uploading bugfix (client)</a></li>
<li><a href="#org8d39e6b"><span class="todo TODO">TODO</span> Refactoring a part of code</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgfaf6e55" class="outline-2">
<h2 id="orgfaf6e55">Server <code>[3/7]</code>:</h2>
<div class="outline-text-2" id="text-orgfaf6e55">
</div>
<div id="outline-container-orgd09a63a" class="outline-3">
<h3 id="orgd09a63a"><span class="todo DOING">DOING</span> Add other (VK, Google) auth strategy</h3>
</div>
<div id="outline-container-org54cb7c1" class="outline-3">
<h3 id="org54cb7c1"><span class="todo TODO">TODO</span> Move <i><a href="https://localhost:3001">https://localhost:3001</a></i> on server files to `.env`</h3>
</div>
<div id="outline-container-org7e1dc23" class="outline-3">
<h3 id="org7e1dc23"><span class="todo TODO">TODO</span> Add auth with SMS step</h3>
</div>
<div id="outline-container-orgcd05cd2" class="outline-3">
<h3 id="orgcd05cd2"><span class="todo TODO">TODO</span> Photo uploading bugfix (server)</h3>
</div>
<div id="outline-container-orgf87ab92" class="outline-3">
<h3 id="orgf87ab92"><span class="done DONE">DONE</span> Bugfix on database</h3>
<div class="outline-text-3" id="text-orgf87ab92">
</div>
</div>
<div id="outline-container-org964deec" class="outline-3">
<h3 id="org964deec"><span class="done DONE">DONE</span> Rewrite all twitter part of code to github</h3>
<div class="outline-text-3" id="text-org964deec">
</div>
</div>
<div id="outline-container-org19ac4bb" class="outline-3">
<h3 id="org19ac4bb"><span class="done DONE">DONE</span> Rewrite all components from JS to TS</h3>
<div class="outline-text-3" id="text-org19ac4bb">
</div>
</div>
</div>

<div id="outline-container-org2076f65" class="outline-2">
<h2 id="org2076f65">Client <code>[0/3]</code>:</h2>
<div class="outline-text-2" id="text-org2076f65">
</div>
<div id="outline-container-orge3744d0" class="outline-3">
<h3 id="orge3744d0"><span class="todo TODO">TODO</span> Add responsive for mobile and tablet</h3>
</div>
<div id="outline-container-orgdaafb8b" class="outline-3">
<h3 id="orgdaafb8b"><span class="todo TODO">TODO</span> Photo uploading bugfix (client)</h3>
</div>
<div id="outline-container-org8d39e6b" class="outline-3">
<h3 id="org8d39e6b"><span class="todo TODO">TODO</span> Refactoring a part of code</h3>
<div class="outline-text-3" id="text-org8d39e6b">
<div class="org-src-container">
<pre class="src src-js">React.useEffect(() =&gt; {
	window.addEventListener('message', ({ data, origin }) =&gt; {
		const user: string = data;
		if (typeof user === 'string' &amp;&amp; data.includes('avatarUrl')) {
			// Проверяем, строка-ли user: если да -- проверяет, включают-ли данные в себя avatarUrl
			setUserData(JSON.parse(user));
			onNextStep();
		}
	});
});
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Berezhnev Vladimir (Tell396)</p>
<p class="date">Created: 2022-11-01 Вт 00:54</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
